app/Controllers/Keluhan.php

INSERT INTO `keluhan` (`npm`, `keluhan`, `deskripsi_keluhan`, `id_kategori`) VALUES ('1918101514', 'batuk', 'Ada', '1')
---
    public function add_keluhan()    {
        $npm = session('npm');
        $keluhan = $this->request->getVar('keluhan');
        $deskripsi_keluhan = $this->request->getVar('deskripsi_keluhan');
        $kategori_keluhan = $this->request->getVar('kategori_keluhan');

        $data = array(
            'npm'=>$npm,
            'keluhan'=>$keluhan,
            'deskripsi_keluhan'=>$deskripsi_keluhan,
            'id_kategori' => $kategori_keluhan
        );
        var_dump($data);
        $tambah =  $this->keluhanmodel->insert($data);