app/Controllers/Penanganan.php

        if ($update) {
            if(!empty($filtered) ){

                $update_obat =  $this->obatmodel->updateBatch($data_obat,'id_obat');
---
UPDATE `obat` SET `keterangan_obat` = CASE 
WHEN `id_obat` = '94' THEN 'xaxx x'
WHEN `id_obat` = '96' THEN 'aaxxx'
ELSE `keterangan_obat` END, `id_penanganan` = CASE 
WHEN `id_obat` = '94' THEN '78'
WHEN `id_obat` = '96' THEN '78'
ELSE `id_penanganan` END, `nama_obat` = CASE 
WHEN `id_obat` = '94' THEN 'Hematon'
WHEN `id_obat` = '96' THEN 'veve'
ELSE `nama_obat` END
WHERE `id_obat` IN('94','96')