app/Models/PenangananModel.php

    public function updatePenanganan($data,$id_penanganan)
    {
        $this->set($data);
        $this->where('id_penanganan',$id_penanganan);
        return $this->update();
---
UPDATE `penanganan` SET `npm` = '1918101514', `id_keluhan` = '80', `keterangan` = '', `tindak_lanjut` = 'Ke RS CISEENG'
WHERE `id_penanganan` = '78'