app/Models/UsersModel.php

    public function updateIsoman($data,$where)
    {
        $this->set($data);
        $this->where($where);
        return $this->update();
---
UPDATE `users` SET `isoman` = '1'
WHERE `npm` = '1918101514'